kotopes45.ru/models/Animals.php

SELECT * FROM `animals` WHERE (`userid`=148) AND (`checkrecord`=1) ORDER BY `dateinsert` DESC
SELECT * FROM `animals` WHERE (`userid` != 148) AND (`checkrecord`=1) ORDER BY `dateinsert` DESC
---
    public static function getInfo($userid)
    {
        if($userid == null){
            return self::find()->orderBy(['dateinsert' => SORT_DESC])->where(['checkrecord' => 1])->all();
        }
        else {
            $query = self::find()->where(['userid' => $userid,'checkrecord' => 1])->orderBy(['dateinsert' => SORT_DESC])->all();
            $query2 = self::find()->where(['!=', 'userid', $userid])->andWhere(['checkrecord' => 1])->orderBy(['dateinsert' => SORT_DESC])->all();