kotopes45.ru/models/Filtername.php

SELECT * FROM `filtername` ORDER BY `typeproductid`, `id`
---
    public static function getInfo()
    {
        return self::find()->orderBy(['typeproductid' => SORT_ASC, 'id' => SORT_ASC])->all();