kotopes45.ru/models/Filterparam.php

SELECT * FROM `filterparam` ORDER BY `filternameid`, `name`
---
    public static function getInfo()
    {
        return self::find()->orderBy(['filternameid' => SORT_ASC])->all();