kotopes45.ru/models/Hots.php

SELECT * FROM `hots` ORDER BY `id`
---
    public static function getInfo()
    {
        return self::find()->orderBy(['id' => SORT_ASC])->all();