kotopes45.ru/models/Products.php

    public static function getInfo()
    {
        return self::find()->orderBy(['id' => SORT_ASC])->all();
---
SELECT * FROM `products` ORDER BY `id` DESC