kotopes45.ru/models/Userssearchhistory.php

    public static function getInfo($user_id)
    {
        return self::find()->select(['searchtext'])->asArray()->where(['user_id' => $user_id])->orderBy(['id' => SORT_DESC])->limit(5)->all();
---
SELECT `searchtext` FROM `userssearchhistory` WHERE `user_id`=148 ORDER BY `id` DESC LIMIT 5