kotopes45.ru/kotopes45.ru/controllers/AdminController.php

    public function actionNewvariaton()
    {
        $products = new Products();
        $products->name = Yii::$app->request->post('productname');
        $products->description = Yii::$app->request->post('productdescription');
        $products->save();
---
INSERT INTO `products` (`name`, `description`) VALUES (NULL, NULL)

    public function actionNewstext($dateid)
    {
        if ($text_list = Yii::$app->request->post('Informationtextlist')) {
            foreach ($text_list as $key => $text) {
                if($text['id'] == 0){
                    $model = new Informationtextlist;
                    if($text['text'] != ""){
                        $model->text = $text['text'];
                    }
                    $model->link = $text['link'];
                    $model->informationdateslist_id = $dateid;
                    $model->save();
                }else{
                    $model = Informationtextlist::findOne($text['id']);
---
INSERT INTO `informationtextlist` (`text`, `link`, `informationdateslist_id`) VALUES ('444', '444', 14)
SELECT * FROM `informationtextlist` WHERE `id`='25'
SELECT EXISTS(SELECT * FROM `informationdateslist` WHERE `informationdateslist`.`id`=14)
SELECT * FROM `informationdateslist` WHERE `id`='14'

    public function actionChangenews()
    {
        $model = Informationdateslist::findOne(yii::$app->request->post('Informationdateslist')["id"]);
---
SELECT * FROM `informationdateslist` WHERE `id`='13'

    public function actionDeletenews()
    {
        Informationdateslist::findOne(yii::$app->request->post('newsid'))->delete();
---
DELETE FROM `informationdateslist` WHERE `id`=13

    public function actionDeletenewsproducts()
    {
        Informationtextlist::findOne(yii::$app->request->post('productid'))->delete();
---
DELETE FROM `informationtextlist` WHERE `id`=24
SELECT * FROM `informationtextlist` WHERE `id`='24'