<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'Вы забанены';
?>
    <div class = "col-lg-12 col-md-12 col-sm-12 col-xs-12">
        <p class ="feedtext">Вы были забанены на этом сайте. Если вы считаете, что это произошло по ошибке, свяжитесь с администрацией любым удобным
        для вас способом. Телефон: 8-992-425-23-48. Адрес электронной почты: mkotopes.online@ya.ru. В обращении укажите адрес электронной почты, введённый вами при регистрации на сайте.</p>
    </div>
