<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = 'О нас | Котопёс КУРГАН | Официальный сайт';
?>
<div class="site-about otstuptextforinformation textforinformation">
    <div class = "col-lg-offset-3 col-lg-6 col-md-6 col-md-offset-3 col-sm-8 col-sm-offset-2 col-xs-12 col-xs-offset-0">
        <p>Здравствуйте! С 2007 года "Котопёс" по адресу ул. Коли Мяготина 102 трудится, обеспечивая Ваших животных всем необходимым, и даже больше.<br></p>
        <img style = "width: 93%;" src = "/images/about.jpg">
        <p><br>За это время мы наладили партнерство с многими специализированными торговыми фирмами из разных городов России, работающих с крупными производителями по всему миру.<br><br>
            Сейчас мы рады приветствовать Вас и в сети Интернет. Интернет-магазин предназначен для Вашего удобства и экономии времени. Вы можете заказать необходимый товар из дома, а наши курьеры доставят его для Вас.<br><br>
            Мы открыты для ваших конструктивных замечаний и предложений. Для этого создан специальный раздел "<?= Html::a('Обратная связь', ['site/feedback'])?>", где вы сможете высказать свои пожелания по поводу работы сайта, ассортимента, доставки и обслуживания.<br><br>
            Мы благодарны за оказанное доверие всем нашим покупателям. Спасибо, что Вы с нами!<br><br>
            Вы наверняка заметили, что ассортимент Интернет-магазина значительно меньше, чем ассортимент магазина на ул. Коли Мяготина,
            102? Дело в том, что есть товары, которые перед покупкой необходимо потрогать, примерить, подержать (к примеру, одежда или игрушки),
            поэтому мы не продаём их через онлайн версию нашего магазина, но Вы всегда можете прийти к нам и купить то, что Вам необходимо.<br><br>
            На сегодняшний день существует огромное количество товаров для животных от известных брендов, и мы постоянно работаем над расширением нашего ассортимента,
            а пока что Вы можете заказать даже тот товар, который отсутствует на нашем сайте, для этого воспользуйтесь разделом "<?= Html::a('Заказать товар', ['site/order'])?>".<br><br>
            До скорых встреч!</p>
    </div>
</div>
