kotopes45.ru/kotopes45.ru/models/Basket.php

    public static function getInfoCountVariationByUserId($userid)
    {
        return self::find()->select('count')->where(['user_id' => $userid])->all();
---
SELECT `count` FROM `basket` WHERE `user_id`=148

    public static function getInfoByUserIdAndVariationId($userid, $variationid)
    {
        return self::find()->where(['user_id' => $userid, 'variation_id' => $variationid])->one();
---
SELECT * FROM `basket` WHERE (`user_id`=148) AND (`variation_id`=89)