kotopes45.ru/kotopes45.ru/models/Informationdateslist.php

SELECT * FROM `informationdateslist` ORDER BY `id`
---
    public static function getInfo()
    {
        return self::find()->orderBy(['id' => SORT_ASC])->all();