kotopes45.ru/kotopes45.ru/models/Typeanimals.php

SELECT * FROM `typeanimals` ORDER BY `id`
---
    public static function getInfo()
    {
        return self::find()->orderBy(['id' => SORT_ASC])->all();