kotopes45.ru/kotopes45.ru/models/Typeproduct.php

SELECT * FROM `typeproduct` ORDER BY `typeanimalsname`
---
    public static function getInfo()
    {
        return self::find()->orderBy(['typeanimalsname' => SORT_ASC])->all();